import React from 'react'
import { Container } from 'react-bootstrap'

const Index = () => {
  return (
    <Container>
      <p>
        由於市面上常見的遊戲類型包羅萬象、一應俱全，而為了有更好的參考依據和想法，因此我們選定射擊遊戲作為我們的題目，射擊遊戲一直是經久不衰的遊戲類型，在電腦遊戲發展至今也都存在射擊遊戲的身影，也有很大比例的遊戲玩家都是從接觸射擊遊戲開始自己的遊戲生涯。同時當前VR系統有日漸普及化的趨勢，在現實中，虛擬實境遊戲平台算是眾多廠商的必爭之地，大家都希望能打造出VR的生態圈，在各種感測元件和軟體優化將玩家帶入有如身歷其境的沈浸感都超越了以往所帶來的體驗，所以將我們題目加入了VR的概念，來增加遊戲的趣味性，也就造就了我們決定以VR射擊遊戲作為我們的主題，藉這個機會能以遊戲開發者的角度來研發VR遊戲內容，希望更進一步的了解VR虛擬實境的架構，更能將此次經驗帶入到職場上。
      </p>
    </Container>
  )
}

export default Index
